# frozen_string_literal: true

module Constants
  INITIAL_BANK = 100
  INITIAL_SUM = 0

  CARD_POINTS = {
    '🂡': 11, '🂢': 2, '🂣': 3,  '🂤': 4,  '🂥': 5,  '🂦': 6,
    '🂧': 7,  '🂨': 8, '🂩': 9,  '🂪': 10, '🂫': 10, '🂭': 10, '🂮': 10,
    '🂱': 11, '🂲': 2, '🂳': 3,  '🂴': 4,  '🂵': 5,  '🂶': 6,  '🂷': 7,
    '🂸': 8,  '🂹': 9, '🂺': 10, '🂻': 10, '🂽': 10, '🂾': 10,
    '🃁': 11, '🃂': 2, '🃃': 3,  '🃄': 4,  '🃅': 5,  '🃆': 6,
    '🃇': 7,  '🃈': 8, '🃉': 9,  '🃊': 10, '🃋': 10, '🃍': 10, '🃎': 10,
    '🃑': 11, '🃒': 2, '🃓': 3,  '🃔': 4,  '🃕': 5,  '🃖': 6,
    '🃗': 7,  '🃘': 8, '🃙': 9,  '🃚': 10, '🃛': 10, '🃝': 10, '🃞': 10
  }.freeze

  CARDS = CARD_POINTS.keys

  MAKE_MOVE = "1. Пропуск хода\n2. Добавить карту\n3. Открыть карты\nВыберите вариант (1-3)"
  INPUT_ERROR = 'Ошибка ввода. Введите правильный вариант.'
end
